//******************************************************************************
//
// タイトル:		協力モードのボス処理
// プログラム名:	boss.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _BOSS_H_
#define _BOSS_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define MAX_BOSS					(1)	// オブジェクトの数

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	D3DXVECTOR3 dotPos;
	D3DXVECTOR3 pos;
	D3DXVECTOR3 rot;
	D3DXVECTOR3 move;
	D3DXVECTOR3 size;
	DIRECTION dir;
	int nCounterAnim;	// ポリゴンのアニメーションカウンター
	int nPatternAnim;	// ポリゴンのアニメーションパターンNo.
	bool walking;
	bool bUse; 
	int life;
	int nCounterHurt;
	int nCounterDeath;
}BOSS;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
HRESULT InitBoss(void);
void DrawBoss(void);		
void UninitBoss(void);
void UpdateBoss(void);
void SetBoss(D3DXVECTOR3 pos);
BOSS *GetBoss(void);
void SetColorBoss(int nCntBoss, int R, int G, int B, int A);										
#endif