//******************************************************************************
//
// タイトル:		爆弾処理
// プログラム名:	bullet.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _BULLET_H_
#define _BULLET_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define MAX_BULLET					(50)							// オブジェクトの数

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	D3DXVECTOR3 pos;
	//D3DXVECTOR3 rot;
	//D3DXVECTOR3 move;
	D3DXVECTOR3 size;
	int who_setted;
	int power;
	bool bUse;			//発射中かどうか
	int nCounterAnim;	// ポリゴンのアニメーションカウンター
	int nPatternAnim;	// ポリゴンのアニメーションパターンNo.
	int nCounterExpo;
}BULLET;
/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
HRESULT InitBullet(void);
void DrawBullet(void);		
void UninitBullet(void);
void UpdateBullet(void);
void SetBullet(int nPlayerIdx, D3DXVECTOR3 pos, int power);
BULLET *GetBullet(void);

#endif