//******************************************************************************
//
// タイトル:		爆風処理
// プログラム名:	explosion.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _EXPLOSION_H_
#define _EXPLOSION_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define FRAME_BEFORE_EXPLOSION	(120)

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 rot;
	D3DXVECTOR3 move;
	D3DXVECTOR3 size;
	bool bUse; //発射中かどうか
	int who_setted;

	int g_nCounterAnim;	// ポリゴンのアニメーションカウンター
	int	g_nPatternAnim;	// ポリゴンのアニメーションパターンNo.
}EXPLOSION;
/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
HRESULT InitExplosion(void);
void DrawExplosion(void);		
void UninitExplosion(void);
void UpdateExplosion(void);
void SetExplosion(D3DXVECTOR3 pos, int who_setted);
void SetScaleOfExplosion(D3DXVECTOR3 pos, int power, int who_setted);
										
#endif