//******************************************************************************
//
// タイトル:		協力モードの流れ管理処理
// プログラム名:	game_cooperate.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _GAME_COOPERATE_H_
#define _GAME_COOPERATE_H_

#include "main.h"
#include "message.h"

/*******************************************************************************
* 構造体定義
*******************************************************************************/


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitGameCooperate(void);
void UpdateGameCooperate(void);
void DrawGameCooperate(void);
void UninitGameCooperate(void);


#endif