//******************************************************************************
//
// タイトル:		ステージマップの読み込み処理
// プログラム名:	map.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************

#ifndef _MAP_H_
#define _MAP_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "item.h"
#include "block.h"

/*******************************************************************************
* ライブラリのリンク
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define MAP_SIZE_X (25)
#define MAP_SIZE_Y (13)
#define MAX_STAGE	(3)
/*******************************************************************************
* 構造体定義
*******************************************************************************/

typedef struct
{
	int data[MAP_SIZE_Y][MAP_SIZE_X];
	ITEM item[MAP_SIZE_Y][MAP_SIZE_X];
	D3DXVECTOR3 wallPosList[MAP_SIZE_Y*MAP_SIZE_X];
	bool bUseWallList[MAP_SIZE_Y*MAP_SIZE_X];
	int wallListIdx;
}MAP;



/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
HRESULT InitMap(void);
void DrawMap(void);		
void UninitMap(void);
//void UpdateBG(void);
MAP *GetMap(void);
D3DXVECTOR3 Pos2DotPos(D3DXVECTOR3 pos);
D3DXVECTOR3 DotPos2Pos(D3DXVECTOR3 dotPos);
void ChangeMap(D3DXVECTOR3 dotPos, BLOCK_TYPE b_type);
#endif