//******************************************************************************
//
// タイトル:		リザルトの流れ管理処理
// プログラム名:	result.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _RESULT_H_
#define _RESULT_H_

#include "result.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UpdateResult(void);
void DrawResult(void);
void UninitResult(void);

#endif