//******************************************************************************
//
// タイトル:		タイトルの流れ管理処理
// プログラム名:	title.h
// 作成者:			HAL東京ゲーム学科　劉南宏
//
//******************************************************************************


#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);
void UninitTitle(void);

#endif